Revit.Elements.Element.Parameters
Obtain all of the Parameters from an Element, sorted by Name.

Revit.Elements.Element.GetCategory
Get Element Category

Revit.Elements.Element.ElementType
Returns the FamilyType for this Element. Returns null if the Element cannot have a FamilyType assigned.
Element Type or Null.

Revit.Elements.Element.IsFrozen
Set the element's freeze state. If the node is set to freeze
all the elements for that node will be set to freeze.

Revit.Elements.Element.GetParameterByName(System.String)
Get a parameter by name of an element
parameterName: The name of the parameter.
Returns:

Revit.Elements.Element.OverrideInView(Revit.Filter.OverrideGraphicSettings,System.Boolean)
Override Elements Graphics Settings in Active View.
overrides: Override Graphics Settings.
hide: If True given Element will be hidden.
Returns:

Revit.Elements.Element.SetLocation(Autodesk.DesignScript.Geometry.Geometry)
Update an existing element's location
geometry: New Location Point or Curve

Revit.Elements.Element.GetLocation
Get an exsiting element's location
Returns: Location Geometry

Revit.Elements.Element.MoveByVector(Autodesk.DesignScript.Geometry.Vector)
Move Revit Element by Vector
vector: Translation Vector

Revit.Elements.Element.GetMaterials(System.Boolean)
Get Material Names from a Revit Element
paintMaterials: Paint Materials
Returns: List of Names